#### 📖 Terraform Plan ('src/legacy-apim/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
n-rg-01"
    }

  # module.apim_itn_io_backend_notifications_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "IO backend APIs - notifications"
      + display_name          = "IO BACKEND API - notifications"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "p-io-backend-notifications-api-v1"
      + path                  = "api/io-backend/notifications"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-json"
          + content_value  = jsonencode(
                {
                  + basePath            = "/api/v1"
                  + consumes            = [
                      + "application/json",
                    ]
                  + definitions         = {
                      + CreatedMessageWithContent    = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/CreatedMessageWithContent"
                        }
                      + CreatedMessageWithoutContent = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/CreatedMessageWithoutContent"
                        }
                      + DepartmentName               = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/DepartmentName"
                        }
                      + FiscalCode                   = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/FiscalCode"
                        }
                      + MessageBodyMarkdown          = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/MessageBodyMarkdown"
                        }
                      + MessageContent               = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/MessageContent"
                        }
                      + MessageSubject               = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/MessageSubject"
                        }
                      + Notification                 = {
                          + description = "A received Notification."
                          + properties  = {
                              + message         = {
                                  + "$ref" = "#/definitions/NotificationMessage"
                                }
                              + sender_metadata = {
                                  + "$ref" = "#/definitions/SenderMetadata"
                                }
                            }
                          + required    = [
                              + "message",
                              + "sender_metadata",
                            ]
                          + title       = "Notification"
                          + type        = "object"
                        }
                      + NotificationMessage          = {
                          + allOf    = [
                              + {
                                  + "$ref" = "#/definitions/CreatedMessageWithContent"
                                },
                              + {
                                  + "$ref" = "#/definitions/CreatedMessageWithoutContent"
                                },
                            ]
                          + x-one-of = true
                        }
                      + OrganizationName             = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/OrganizationName"
                        }
                      + PaymentAmount                = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/PaymentAmount"
                        }
                      + PaymentData                  = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/PaymentData"
                        }
                      + PaymentNoticeNumber          = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/PaymentNoticeNumber"
                        }
                      + ProblemJson                  = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/ProblemJson"
                        }
                      + SenderMetadata               = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/SenderMetadata"
                        }
                      + ServiceId                    = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/ServiceId"
                        }
                      + ServiceName                  = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/ServiceName"
                        }
                      + SuccessResponse              = {
                          + properties = {
                              + message = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                      + TimeToLiveSeconds            = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/TimeToLiveSeconds"
                        }
                      + Timestamp                    = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.0.0/openapi/definitions.yaml#/Timestamp"
                        }
                    }
                  + host                = "api-app.internal.io.pagopa.it"
                  + info                = {
                      + description = "Mobile and web proxy API gateway."
                      + title       = "Proxy API"
                      + version     = "1.0.0"
                    }
                  + parameters          = {}
                  + paths               = {
                      + "/notify" = {
                          + post                        = {
                              + description = "Post the notification to the user using a push notification."
                              + operationId = "notify"
                              + parameters  = [
                                  + {
                                      + in         = "body"
                                      + name       = "body"
                                      + required   = true
                                      + schema     = {
                                          + "$ref" = "#/definitions/Notification"
                                        }
                                      + x-examples = {
                                          + "application/json" = {
                                              + message         = {
                                                  + content           = {
                                                      + markdown = "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Maecenas et mollis felis. Vivamus orci nisl, commodo ut sodales ut, eleifend a libero. Donec dapibus, turpis in mattis tempor, risus nunc malesuada ex, non aliquet metus nunc a lacus. Aenean in arcu vitae nisl porta fermentum nec non nibh. Phasellus tortor tellus, semper in metus eget, eleifend laoreet nibh. Aenean feugiat lectus ut nisl eleifend gravida."
                                                      + subject  = "message subject, aliquip sint nulla in estinut"
                                                    }
                                                  + created_at        = "2018-05-03T16:21:38.167Z"
                                                  + fiscal_code       = "TMMEXQ60A10Y526X"
                                                  + id                = "01CCKCY7QQ7WCHWTH8NB504386"
                                                  + sender_service_id = "5a25abf4fcc89605c082f042c49a"
                                                }
                                              + sender_metadata = {
                                                  + department_name   = "Department name"
                                                  + organization_name = "Organization name"
                                                  + service_name      = "Service name"
                                                }
                                            }
                                        }
                                    },
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = "Success."
                                      + examples    = {
                                          + "application/json" = {
                                              + message = "ok"
                                            }
                                        }
                                      + schema      = {
                                          + "$ref" = "#/definitions/SuccessResponse"
                                        }
                                    }
                                  + "400" = {
                                      + description = "Bad request"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                  + "401" = {
                                      + description = "Token null or invalid."
                                    }
                                  + "500" = {
                                      + description = "There was an error in forwarding the notification to the Notification Hub."
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              + summary     = "Notify a user"
                            }
                          + x-swagger-router-controller = "NotificationController"
                        }
                    }
                  + produces            = [
                      + "application/json",
                    ]
                  + responses           = {}
                  + schemes             = [
                      + "https",
                    ]
                  + security            = [
                      + {
                          + Token = []
                        },
                    ]
                  + securityDefinitions = {
                      + Token = {
                          + in   = "query"
                          + name = "token"
                          + type = "apiKey"
                        }
                    }
                  + swagger             = "2.0"
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn_io_backend_notifications_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-notifications-api-v1"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net/api/v1" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net/api/v1" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn_io_backend_notifications_api_v1.azurerm_api_management_product_api.this["io-backend"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-notifications-api-v1"
      + id                  = (known after apply)
      + product_id          = "io-backend"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn_io_backend_pagopa_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "IO backend APIs - pagopa"
      + display_name          = "IO BACKEND API - pagopa"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "p-io-backend-pagopa-api-v1"
      + path                  = "pagopa/api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-json"
          + content_value  = jsonencode(
                {
                  + basePath            = "/pagopa/api/v1"
                  + consumes            = [
                      + "application/json",
                    ]
                  + definitions         = {
                      + EmailAddress  = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v5.0.0/openapi/definitions.yaml#/EmailAddress"
                        }
                      + FederatedUser = {
                          + "$ref" = "api_backend.yaml#/definitions/FederatedUser"
                        }
                      + FiscalCode    = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v5.0.0/openapi/definitions.yaml#/FiscalCode"
                        }
                      + PagoPAUser    = {
                          + allOf       = [
                              + {
                                  + "$ref" = "#/definitions/FederatedUser"
                                },
                              + {
                                  + properties = {
                                      + notice_email = {
                                          + "$ref" = "#/definitions/EmailAddress"
                                        }
                                      + spid_email   = {
                                          + "$ref" = "#/definitions/EmailAddress"
                                        }
                                    }
                                  + required   = [
                                      + "notice_email",
                                    ]
                                  + type       = "object"
                                },
                            ]
                          + description = "User data needed by PagaPA proxy."
                          + title       = "PagoPA user"
                        }
                      + ProblemJson   = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v5.0.0/openapi/definitions.yaml#/ProblemJson"
                        }
                    }
                  + host                = "api-app.internal.io.pagopa.it"
                  + info                = {
                      + description = "Mobile and web proxy API gateway."
                      + title       = "Proxy API"
                      + version     = "1.0.0"
                    }
                  + parameters          = {}
                  + paths               = {
                      + "/user" = {
                          + get                         = {
                              + description = "Returns the user data needed by PagoPA Wallet backend."
                              + operationId = "getUser"
                              + parameters  = [
                                  + {
                                      + enum = [
                                          + "20200114",
                                        ]
                                      + in   = "query"
                                      + name = "version"
                                      + type = "string"
                                    },
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = "Found."
                                      + examples    = {
                                          + "application/json" = {
                                              + email       = "email@example.com"
                                              + family_name = "Surname"
                                              + name        = "Name"
                                            }
                                        }
                                      + schema      = {
                                          + "$ref" = "#/definitions/PagoPAUser"
                                        }
                                    }
                                  + "400" = {
                                      + description = "Bad request."
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                  + "401" = {
                                      + description = "Token null or invalid."
                                    }
                                  + "404" = {
                                      + description = "User Profile not found"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                  + "429" = {
                                      + description = "Too many requests"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                  + "500" = {
                                      + description = "There was an error in retrieving the user data."
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              + summary     = "Get user's data"
                            }
                          + x-swagger-router-controller = "PagoPAController"
                        }
                    }
                  + produces            = [
                      + "application/json",
                    ]
                  + responses           = {}
                  + schemes             = [
                      + "https",
                    ]
                  + security            = [
                      + {
                          + Token = []
                        },
                    ]
                  + securityDefinitions = {
                      + Token = {
                          + in   = "query"
                          + name = "token"
                          + type = "apiKey"
                        }
                    }
                  + swagger             = "2.0"
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn_io_backend_pagopa_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-pagopa-api-v1"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net/pagopa/api/v1" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net/pagopa/api/v1" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn_io_backend_pagopa_api_v1.azurerm_api_management_product_api.this["io-backend"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-pagopa-api-v1"
      + id                  = (known after apply)
      + product_id          = "io-backend"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn_io_backend_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for IO backend"
      + display_name          = "IO BACKEND"
      + id                    = (known after apply)
      + product_id            = "io-backend"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim_itn_io_backend_product.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-backend"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn_io_backend_public_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "IO backend APIs - public"
      + display_name          = "IO BACKEND API - public"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "p-io-backend-public-api-v1"
      + path                  = "api/io-backend/public"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-json"
          + content_value  = jsonencode(
                {
                  + basePath    = "/"
                  + consumes    = [
                      + "application/json",
                    ]
                  + definitions = {
                      + AccessToken        = {
                          + properties = {
                              + token = {
                                  + minLength = 1
                                  + type      = "string"
                                }
                            }
                          + required   = [
                              + "token",
                            ]
                          + type       = "object"
                        }
                      + FiscalCode         = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v5.0.0/openapi/definitions.yaml#/FiscalCode"
                        }
                      + PasswordLogin      = {
                          + properties = {
                              + password = {
                                  + minLength = 1
                                  + type      = "string"
                                }
                              + username = {
                                  + "$ref" = "#/definitions/FiscalCode"
                                }
                            }
                          + required   = [
                              + "username",
                              + "password",
                            ]
                          + type       = "object"
                        }
                      + ProblemJson        = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v5.0.0/openapi/definitions.yaml#/ProblemJson"
                        }
                      + ServerInfo         = {
                          + properties = {
                              + min_app_version        = {
                                  + "$ref" = "#/definitions/VersionPerPlatform"
                                }
                              + min_app_version_pagopa = {
                                  + "$ref" = "#/definitions/VersionPerPlatform"
                                }
                              + version                = {
                                  + type = "string"
                                }
                            }
                          + required   = [
                              + "version",
                              + "min_app_version",
                              + "min_app_version_pagopa",
                            ]
                          + title      = "Server information"
                          + type       = "object"
                        }
                      + VersionPerPlatform = {
                          + properties = {
                              + android = {
                                  + type = "string"
                                }
                              + ios     = {
                                  + type = "string"
                                }
                            }
                          + required   = [
                              + "ios",
                              + "android",
                            ]
                          + title      = "Specify a version for ios and another for android"
                          + type       = "object"
                        }
                    }
                  + host        = "api-app.internal.io.pagopa.it"
                  + info        = {
                      + description = "Mobile and web proxy API gateway."
                      + title       = "Public API"
                      + version     = "1.0.0"
                    }
                  + paths       = {
                      + "/info"       = {
                          + get                         = {
                              + description = <<-EOT
                                    Returns runtime information about the server.
                                EOT
                              + operationId = "getServerInfo"
                              + responses   = {
                                  + "200" = {
                                      + description = "Runtime server info."
                                      + examples    = {
                                          + "application/json" = {
                                              + min_app_version        = "0.0.0"
                                              + min_app_version_pagopa = "0.0.0"
                                              + version                = "0.0.1"
                                            }
                                        }
                                      + schema      = {
                                          + "$ref" = "#/definitions/ServerInfo"
                                        }
                                    }
                                }
                              + summary     = "Runtime server info"
                            }
                          + x-swagger-router-controller = "ServerInfoController"
                        }
                      + "/test-login" = {
                          + post                        = {
                              + description = "Login Test User with password and Fiscal Code"
                              + operationId = "testLogin"
                              + parameters  = [
                                  + {
                                      + in         = "body"
                                      + name       = "body"
                                      + required   = true
                                      + schema     = {
                                          + "$ref" = "#/definitions/PasswordLogin"
                                        }
                                      + x-examples = {
                                          + "application/json" = {
                                              + password = "secret"
                                              + username = "AAABBB01C02D345Z"
                                            }
                                        }
                                    },
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = "Access token"
                                      + schema      = {
                                          + "$ref" = "#/definitions/AccessToken"
                                        }
                                    }
                                  + "401" = {
                                      + description = "Invalid credentials"
                                    }
                                  + "500" = {
                                      + description = "Unavailable service"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              + summary     = "Login Test User with password"
                            }
                          + x-swagger-router-controller = "AuthenticationController"
                        }
                    }
                  + produces    = [
                      + "application/json",
                    ]
                  + schemes     = [
                      + "https",
                    ]
                  + swagger     = "2.0"
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn_io_backend_public_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-public-api-v1"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn_io_backend_public_api_v1.azurerm_api_management_product_api.this["io-backend"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-public-api-v1"
      + id                  = (known after apply)
      + product_id          = "io-backend"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn_io_backend_session_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "IO backend APIs - session"
      + display_name          = "IO BACKEND API - session"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "p-io-backend-session-api-v1"
      + path                  = "api/io-backend/session"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-json"
          + content_value  = jsonencode(
                {
                  + basePath    = "/api/v1"
                  + consumes    = [
                      + "application/json",
                    ]
                  + definitions = {
                      + FiscalCode      = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.5.3/openapi/definitions.yaml#/FiscalCode"
                        }
                      + ProblemJson     = {
                          + "$ref" = "https://raw.githubusercontent.com/pagopa/io-functions-commons/v21.5.3/openapi/definitions.yaml#/ProblemJson"
                        }
                      + SuccessResponse = {
                          + properties = {
                              + message = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                    }
                  + host        = "api-app.internal.io.pagopa.it"
                  + info        = {
                      + description = "Collection of enpoints to interact with user session."
                      + title       = "Session API"
                      + version     = "1.0.0"
                    }
                  + parameters  = {
                      + FiscalCode = {
                          + description = "The fiscal code of the user, all upper case."
                          + in          = "path"
                          + maxLength   = 16
                          + minLength   = 16
                          + name        = "fiscalcode"
                          + required    = true
                          + type        = "string"
                          + x-example   = "SPNDNL80R13C555X"
                        }
                      + Token      = {
                          + description = "The API key used to access this webhooks."
                          + in          = "query"
                          + name        = "token"
                          + required    = true
                          + type        = "string"
                        }
                    }
                  + paths       = {
                      + "/sessions/{fiscalcode}/lock" = {
                          + delete = {
                              + description = "Use this operation if you want to unblock a user and re-allow to login. The operation succeed if the user wasn't blocked"
                              + operationId = "unlockUserSession"
                              + parameters  = [
                                  + {
                                      + "$ref" = "#/parameters/FiscalCode"
                                    },
                                  + {
                                      + "$ref" = "#/parameters/Token"
                                    },
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = "Success."
                                      + examples    = {
                                          + "application/json" = {
                                              + message = "ok"
                                            }
                                        }
                                      + schema      = {
                                          + "$ref" = "#/definitions/SuccessResponse"
                                        }
                                    }
                                  + "400" = {
                                      + description = "Bad request"
                                    }
                                  + "401" = {
                                      + description = "Token null or invalid."
                                    }
                                  + "500" = {
                                      + description = "There was an error"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              + summary     = "Remove a lock to a user session"
                            }
                          + post   = {
                              + description = "Use this operation if you want to block a user to log in. The operation succeed if the user is already blocked"
                              + operationId = "lockUserSession"
                              + parameters  = [
                                  + {
                                      + "$ref" = "#/parameters/FiscalCode"
                                    },
                                  + {
                                      + "$ref" = "#/parameters/Token"
                                    },
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = "Success."
                                      + examples    = {
                                          + "application/json" = {
                                              + message = "ok"
                                            }
                                        }
                                      + schema      = {
                                          + "$ref" = "#/definitions/SuccessResponse"
                                        }
                                    }
                                  + "400" = {
                                      + description = "Bad request"
                                    }
                                  + "401" = {
                                      + description = "Token null or invalid."
                                    }
                                  + "404" = {
                                      + description = "User not found."
                                    }
                                  + "500" = {
                                      + description = "There was an error"
                                      + schema      = {
                                          + "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              + summary     = "Lock a user session and delete session data"
                            }
                        }
                    }
                  + produces    = [
                      + "application/json",
                    ]
                  + responses   = {}
                  + schemes     = [
                      + "https",
                    ]
                  + swagger     = "2.0"
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn_io_backend_session_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-session-api-v1"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net/api/v1" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net/api/v1" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn_io_backend_session_api_v1.azurerm_api_management_product_api.this["io-backend"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "p-io-backend-session-api-v1"
      + id                  = (known after apply)
      + product_id          = "io-backend"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn_product_services.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "SERVICES API for IO platform."
      + display_name          = "IO SERVICES API"
      + id                    = (known after apply)
      + product_id            = "io-services-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim_itn_product_services.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-services-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <choose>
                        <when condition="@(context.User.Groups.Select(g => g.Name).Contains("ApiNoRateLimit"))">
                            <!-- ApiNoRateLimit for internal/special users -->
                        </when>
                        <when condition="@(context.User.Groups.Select(g => g.Name).Contains("ApiRateLimit250"))">
                            <!-- ApiRateLimit 250 requests/5seconds for fast premium users -->
                            <rate-limit-by-key calls="250" renewal-period="5" counter-key="@(context.User.Id)" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
                        </when>
                        <otherwise>
                            <!-- ApiRateLimit 150 requests/5seconds for fast standard users -->
                            <rate-limit-by-key calls="150" renewal-period="5" counter-key="@(context.User.Id)" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
                        </otherwise>
                    </choose>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

Plan: 59 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
